In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(3,2),
                  index = ['a','c','e'],
                  columns = ['one','two'])
df['three'] = 'bar'
df['four'] = df['one'] > 0
df

        one       two three   four
a -0.440424 -1.131111   bar  False
c  0.442517 -0.085526   bar   True
e -0.384090 -0.621112   bar  False

In [3]:
df2 = df.reindex(['a','b','c','d','e'])
df2

        one       two three   four
a -0.440424 -1.131111   bar  False
b       NaN       NaN   NaN    NaN
c  0.442517 -0.085526   bar   True
d       NaN       NaN   NaN    NaN
e -0.384090 -0.621112   bar  False

In [4]:
df2['one'].isna()

a    False
b     True
c    False
d     True
e    False
Name: one, dtype: bool

In [5]:
df2['four'].notna()

a     True
b    False
c     True
d    False
e     True
Name: four, dtype: bool

In [6]:
df2.isna()

     one    two  three   four
a  False  False  False  False
b   True   True   True   True
c  False  False  False  False
d   True   True   True   True
e  False  False  False  False

In [7]:
None == None

True

In [8]:
np.nan == np.nan

False

In [9]:
pd.Series([1,2,np.nan,4])

0    1.0
1    2.0
2    NaN
3    4.0
dtype: float64

In [10]:
pd.Series([1,2,np.nan,4], dtype = 'Int64')

0       1
1       2
2    <NA>
3       4
dtype: Int64

In [11]:
df3 = df.copy()
df3['timestamp'] = pd.Timestamp('2021/12/25')
df3.loc['c','timestamp'] = np.nan
df3

        one       two three   four  timestamp
a -0.440424 -1.131111   bar  False 2021-12-25
c  0.442517 -0.085526   bar   True        NaT
e -0.384090 -0.621112   bar  False 2021-12-25

In [12]:
df3.dtypes.value_counts()

float64           2
object            1
bool              1
datetime64[ns]    1
dtype: int64

In [13]:
df4 = df2.copy()
df4

        one       two three   four
a -0.440424 -1.131111   bar  False
b       NaN       NaN   NaN    NaN
c  0.442517 -0.085526   bar   True
d       NaN       NaN   NaN    NaN
e -0.384090 -0.621112   bar  False

In [14]:
df4[['one','two']] = df4[['one','two']].fillna(0)
df4['three'] = df4['three'].fillna('bar')
df4['four'] = df4['four'].fillna(False)

In [15]:
df4

        one       two three   four
a -0.440424 -1.131111   bar  False
b  0.000000  0.000000   bar  False
c  0.442517 -0.085526   bar   True
d  0.000000  0.000000   bar  False
e -0.384090 -0.621112   bar  False

In [16]:
df5 = df2.copy()
df5.loc['c', 'two'] = np.nan
df5

        one       two three   four
a -0.440424 -1.131111   bar  False
b       NaN       NaN   NaN    NaN
c  0.442517       NaN   bar   True
d       NaN       NaN   NaN    NaN
e -0.384090 -0.621112   bar  False

In [17]:
df5['one'] = df5['one'].fillna(method = "pad")
df5['two'] = df5['two'].fillna(method = "bfill", limit = 2)
df5

        one       two three   four
a -0.440424 -1.131111   bar  False
b -0.440424       NaN   NaN    NaN
c  0.442517 -0.621112   bar   True
d  0.442517 -0.621112   NaN    NaN
e -0.384090 -0.621112   bar  False

In [18]:
df6 = df2.copy()
df6['two'] = np.nan
df6

        one  two three   four
a -0.440424  NaN   bar  False
b       NaN  NaN   NaN    NaN
c  0.442517  NaN   bar   True
d       NaN  NaN   NaN    NaN
e -0.384090  NaN   bar  False

In [19]:
df6.dropna(how = 'all', inplace = True)
df6

        one  two three   four
a -0.440424  NaN   bar  False
c  0.442517  NaN   bar   True
e -0.384090  NaN   bar  False

In [20]:
df6.dropna(axis=1, inplace = True)
df6

        one three   four
a -0.440424   bar  False
c  0.442517   bar   True
e -0.384090   bar  False